lhr-solar/Controls/BSP/STM32F413/Src/BSP_UART.c
/* Copyright (c) 2020 UT Longhorn Racing Solar */

#include "BSP_UART.h"
#include "stm32f4xx.h"

#define TX_SIZE     128
#define RX_SIZE     64

// Initialize the FIFOs

#define FIFO_TYPE char
#define FIFO_SIZE TX_SIZE
#define FIFO_NAME txfifo
#include "fifo.h"
static txfifo_t usbTxFifo;
static txfifo_t bleTxFifo;

#define FIFO_TYPE char
#define FIFO_SIZE RX_SIZE
#define FIFO_NAME rxfifo
#include "fifo.h"
static rxfifo_t usbRxFifo;
static rxfifo_t bleRxFifo;

static bool usbLineReceived = false;
static bool bleLineReceived = false;

static callback_t usbRxCallback = NULL;
static callback_t usbTxCallback = NULL;
static callback_t bleRxCallback = NULL;
static callback_t bleTxCallback = NULL;

static rxfifo_t *rx_fifos[NUM_UART]     = {&usbRxFifo, &bleRxFifo};
static txfifo_t *tx_fifos[NUM_UART]     = {&usbTxFifo, &bleTxFifo};
static bool     *lineRecvd[NUM_UART]    = {&usbLineReceived, &bleLineReceived};
static USART_TypeDef *handles[NUM_UART] = {USART3, USART2};

static void USART_BLE_Init() {
    bleTxFifo = txfifo_new();
    bleRxFifo = rxfifo_new();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    USART_InitTypeDef UART_InitStruct = {0};

    // Initialize clocks
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

    // Initialize pins
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_25MHz;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);

    //Initialize UART2 and 3
    UART_InitStruct.USART_BaudRate = 115200;
    UART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    UART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    UART_InitStruct.USART_Parity = USART_Parity_No;
    UART_InitStruct.USART_StopBits = USART_StopBits_1;
    UART_InitStruct.USART_WordLength = USART_WordLength_8b;
    USART_Init(USART2, &UART_InitStruct);

    USART_Cmd(USART2, ENABLE);

    // Enable NVIC
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

static void USART_USB_Init() {
    usbTxFifo = txfifo_new();
    usbRxFifo = rxfifo_new();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    USART_InitTypeDef UART_InitStruct = {0};

    // Initialize clocks
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

    // Initialize pins
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_25MHz;
    GPIO_Init(GPIOB, &GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_5;
    GPIO_Init(GPIOC, &GPIO_InitStruct);

    GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_USART3);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource5, GPIO_AF_USART3);

    //Initialize UART2 and 3
    UART_InitStruct.USART_BaudRate = 115200;
    UART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    UART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    UART_InitStruct.USART_Parity = USART_Parity_No;
    UART_InitStruct.USART_StopBits = USART_StopBits_1;
    UART_InitStruct.USART_WordLength = USART_WordLength_8b;
    USART_Init(USART3, &UART_InitStruct);

    // Enable interrupts
    USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
    USART_ITConfig(USART3, USART_IT_TC, ENABLE);

    USART_Cmd(USART3, ENABLE);

    // Enable NVIC
    NVIC_InitTypeDef NVIC_InitStructure;
  	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    setvbuf(stdout, NULL, _IONBF, 0);
}

/**
 * @brief   Initializes the UART peripheral
 */
void BSP_UART_Init(callback_t rxCallback, callback_t txCallback, UART_Port usart) {
    switch(usart){
    case UART_USB:
        USART_USB_Init();
        usbRxCallback = rxCallback;
        usbTxCallback = txCallback;
        break;
    case UART_BLE:
        USART_BLE_Init();
        bleRxCallback = rxCallback;
        bleTxCallback = txCallback;
        break;
    default:
        // Error
        break;
    }
}

/**
 * @brief   Gets one line of ASCII text that was received. The '\n' and '\r' characters will not be stored (tested on Putty on Windows)
 * @pre     str should be at least 128bytes long.
 * @param   str : pointer to buffer to store the string. This buffer should be initialized
 *                  before hand.
 * @param   usart : which usart to read from (2 or 3)
 * @return  number of bytes that was read
 */
uint32_t BSP_UART_ReadLine(char *str, UART_Port usart) {
    char data = 0;
    uint32_t recvd = 0;

    bool *line_recvd = lineRecvd[usart];
    if(*line_recvd) {
        USART_TypeDef *usart_handle = handles[usart];

        USART_ITConfig(usart_handle, USART_IT_RXNE, RESET);
        
        rxfifo_t *fifo = rx_fifos[usart];
        
        rxfifo_peek(fifo, &data);
        while(!rxfifo_is_empty(fifo) && data != '\r') {
            recvd += rxfifo_get(fifo, (char*)str++);
            rxfifo_peek(fifo, &data);
        }

        rxfifo_get(fifo, &data);
        *str = 0;
        *line_recvd = false;
        USART_ITConfig(usart_handle, USART_IT_RXNE, SET);
    }

    return recvd;
}

/**
 * @brief   Transmits data to through UART line
 * @param   str : pointer to buffer with data to send.
 * @param   len : size of buffer
 * @param   usart : which usart to read from (2 or 3)
 * @return  number of bytes that were sent
 * 
 * @note This function uses a fifo to buffer the write. If that
 *       fifo is full, this function may block while waiting for
 *       space to open up. Do not call from timing-critical
 *       sections of code.
 */
uint32_t BSP_UART_Write(char *str, uint32_t len, UART_Port usart) {
    uint32_t sent = 0;

    USART_TypeDef *usart_handle = handles[usart];

    USART_ITConfig(usart_handle, USART_IT_TC, RESET);

    txfifo_t *fifo = tx_fifos[usart];

    while(sent < len) {
        if(!txfifo_put(fifo, str[sent])) {
            // Allow the interrupt to fire
            USART_ITConfig(usart_handle, USART_IT_TC, SET);
            // Wait for space to open up
            while(txfifo_is_full(fifo));
            // Disable the interrupt again
            USART_ITConfig(usart_handle, USART_IT_TC, RESET);
        } else {
            sent++;  
        }
    }

    USART_ITConfig(usart_handle, USART_IT_TC, SET);

    return sent;
}

void USART2_IRQHandler(void) {
#ifdef RTOS
    CPU_SR_ALLOC();
    CPU_CRITICAL_ENTER();
    OSIntEnter();
    CPU_CRITICAL_EXIT();
#endif

    if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET) {
        uint8_t data = USART2->DR;
        bool removeSuccess = 1;
        if(data == '\r'){
            bleLineReceived = true;
            if(bleRxCallback != NULL)
                bleRxCallback();
        }
        // Check if it was a backspace.
        // '\b' for minicmom
        // '\177' for putty
        if(data != '\b' && data != '\177') rxfifo_put(&bleRxFifo, data);
        // Sweet, just a "regular" key. Put it into the fifo
        // Doesn't matter if it fails. If it fails, then the data gets thrown away
        // and the easiest solution for this is to increase RX_SIZE
        else {
            char junk;
            // Delete the last entry!
            removeSuccess = rxfifo_popback(&bleRxFifo, &junk);
        }
        if(removeSuccess) {
            USART2->DR = data;
        }
    }
    if(USART_GetITStatus(USART2, USART_IT_TC) != RESET) {
        // If getting data from fifo fails i.e. the tx fifo is empty, then turn off the TX interrupt
        if(!txfifo_get(&usbTxFifo, (char*)&(USART2->DR))) {
            USART_ITConfig(USART2, USART_IT_TC, RESET); // Turn off the interrupt
            if(bleTxCallback != NULL)
                bleTxCallback();    // Callback
        }
    }
    if(USART_GetITStatus(USART2, USART_IT_ORE) != RESET);

#ifdef RTOS
    OSIntExit();
#endif
}

void USART3_IRQHandler(void) {
#ifdef RTOS
    CPU_SR_ALLOC();
    CPU_CRITICAL_ENTER();
    OSIntEnter();
    CPU_CRITICAL_EXIT();
#endif

    if(USART_GetITStatus(USART3, USART_IT_RXNE) != RESET) {
        uint8_t data = USART3->DR;
        bool removeSuccess = 1;
        if(data == '\r'){
            usbLineReceived = true;
            if(usbRxCallback != NULL)
                usbRxCallback();
        }
        // Check if it was a backspace.
        // '\b' for minicmom
        // '\177' for putty
        if(data != '\b' && data != '\177') rxfifo_put(&usbRxFifo, data);
        // Sweet, just a "regular" key. Put it into the fifo
        // Doesn't matter if it fails. If it fails, then the data gets thrown away
        // and the easiest solution for this is to increase RX_SIZE
        else {
            char junk;
            // Delete the last entry!
            removeSuccess = rxfifo_popback(&usbRxFifo, &junk);
        }
        if(removeSuccess) {
            USART3->DR = data;
        }
    }
    if(USART_GetITStatus(USART3, USART_IT_TC) != RESET) {
        // If getting data from fifo fails i.e. the tx fifo is empty, then turn off the TX interrupt
        if(!txfifo_get(&usbTxFifo, (char*)&(USART3->DR))) {
            USART_ITConfig(USART3, USART_IT_TC, RESET);
            if(usbTxCallback != NULL)
                usbTxCallback();
        }
    }
    if(USART_GetITStatus(USART3, USART_IT_ORE) != RESET);

#ifdef RTOS
    OSIntExit();
#endif
}